//
// Copyright (c) 2006-2012, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Description:
//
//    String definitions for Boot Maintenance Utility.

//**/

/=#

#langdef   en-US "English"
#langdef   zh-Hans "Chinese"

#string STR_NULL_STRING                #language en-US  " "
                                       #language zh-Hans  " "
#string STR_NONE                       #language en-US  "NONE"
                                       #language zh-Hans  "NONE"
#string STR_FORM_MAIN_TITLE            #language en-US  "Startup"
                                       #language zh-Hans  "\wide启动\narrow"
#string STR_FORM_BOOT_SETUP_TITLE      #language en-US  "Boot Options"
                                       #language zh-Hans  "Boot Options"
#string STR_FORM_BOOT_SETUP_HELP       #language en-US  "Modify system boot options"
                                       #language zh-Hans  "Modify system boot options"
#string STR_FORM_DRIVER_SETUP_TITLE    #language en-US  "Driver Options"
                                       #language zh-Hans  "Driver Options"
#string STR_FORM_DRIVER_SETUP_HELP     #language en-US  "Modify boot driver options"
                                       #language zh-Hans  "Modify boot driver options"
#string STR_FORM_BOOT_ADD_TITLE        #language en-US  "Add Boot Option"
                                       #language zh-Hans  "Add Boot Option"
#string STR_FORM_BOOT_ADD_HELP         #language en-US  "Add EFI Application or Removable Fs as Boot Option"
                                       #language zh-Hans  "Add EFI Application or Removable Fs as Boot Option"
#string STR_FORM_BOOT_DEL_TITLE        #language en-US  "Delete Boot Option"
                                       #language zh-Hans  "Delete Boot Option"
#string STR_FORM_BOOT_IMMEDIATE_HELP   #language en-US  "Will be valid immediately"
                                       #language zh-Hans  "Will be valid immediately"
#string STR_FORM_BOOT_CHG_TITLE        #language en-US  "Change Boot Order"
                                       #language zh-Hans  "Change Boot Order"
#string STR_FORM_DRV_ADD_TITLE         #language en-US  "Add Driver Option"
                                       #language zh-Hans  "Add Driver Option"
#string STR_FORM_DRV_ADD_HELP          #language en-US  "Add .EFI Driver as Driver Option"
                                       #language zh-Hans  "Add .EFI Driver as Driver Option"
#string STR_FORM_DRV_DEL_TITLE         #language en-US  "Delete Driver Option"
                                       #language zh-Hans  "Delete Driver Option"
#string STR_FORM_DRV_CHG_TITLE         #language en-US  "Change Driver Order"
                                       #language zh-Hans  "Change Driver Order"
#string STR_FORM_NEXT_BOOT_HELP        #language en-US  "Will be valid on next boot"
                                       #language zh-Hans  "Will be valid on next boot"
#string STR_FORM_BOOT_NEXT_TITLE       #language en-US  "Set Boot Next Value"
                                       #language zh-Hans  "Set Boot Next Value"
#string STR_FORM_BOOT_NEXT_HELP        #language en-US  "Modify next boot behavior"
                                       #language zh-Hans  "Modify next boot behavior"
#string STR_FORM_SET_FD_ORDER_TITLE    #language en-US  "Set Legacy Floppy Drive Order"
                                       #language zh-Hans  "Set Legacy Floppy Drive Order"
#string STR_FORM_SET_HD_ORDER_TITLE    #language en-US  "Set Legacy HardDisk Drive Order"
                                       #language zh-Hans  "Set Legacy HardDisk Drive Order"
#string STR_FORM_SET_CD_ORDER_TITLE    #language en-US  "Set Legacy CD-ROM Drive Order"
                                       #language zh-Hans  "Set Legacy CD-ROM Drive Order"
#string STR_FORM_SET_NET_ORDER_TITLE   #language en-US  "Set Legacy NET Drive Order"
                                       #language zh-Hans  "Set Legacy NET Drive Order"
#string STR_FORM_SET_BEV_ORDER_TITLE   #language en-US  "Set Legacy BEV Drive Order"
                                       #language zh-Hans  "Set Legacy BEV Drive Order"
#string STR_NUM_AUTO_BOOT              #language en-US  "Auto Boot Time-out"
                                       #language zh-Hans  "Auto Boot Time-out"
#string STR_HLP_AUTO_BOOT              #language en-US  "Range: 0 to 65535 seconds, 0 means no wait, 65535 means waiting for key"
                                       #language zh-Hans  "Range: 0 to 65535 seconds, 0 means no wait, 65535 means waiting for key"
#string STR_BOOT_NEXT                  #language en-US  "Boot Next Value"
                                       #language zh-Hans  "Boot Next Value"
#string STR_BOOT_NEXT_HELP             #language en-US  "Next boot use this boot option"
                                       #language zh-Hans  "Next boot use this boot option"
#string STR_LOAD_OPTION_DEVPATH        #language en-US  "This is the devicepath"
                                       #language zh-Hans  "This is the devicepath"
#string STR_LOAD_OPTION_DESC           #language en-US  "Input the description"
                                       #language zh-Hans  "Input the description"
#string STR_LOAD_OPTION_ACTIVE         #language en-US  "Load Option Active"
                                       #language zh-Hans  "Load Option Active"
#string STR_LOAD_OPTION_FORCE_RECON    #language en-US  "Load Option Reconnect"
                                       #language zh-Hans  "Load Option Reconnect"
#string STR_SAVE_AND_EXIT              #language en-US  "Commit Changes and Exit"
                                       #language zh-Hans  "Commit Changes and Exit"
#string STR_NO_SAVE_AND_EXIT           #language en-US  "Discard Changes and Exit"
                                       #language zh-Hans  "Discard Changes and Exit"

#string STR_CHANGE_ORDER               #language en-US  "Change Boot Order"
                                       #language zh-Hans  "\wide调整启动顺序\narrow"
#string STR_CHANGE_ORDER_HELP          #language en-US  "Change boot option's priority,Move up with "+",Move down with "-",Enter for select."
                                       #language zh-Hans  "Change boot option's priority,Move up with "+",Move down with "-",Enter for select."
#string STR_BOOT_LEGACY                #language en-US  "Boot Legacy System"
                                       #language zh-Hans  "Boot Legacy System"
#string STR_BOOT_LEGACY_HELP           #language en-US  "Supports boot from legacy FD, HD, CD, PCMCIA, USB, and Network"
                                       #language zh-Hans  "Supports boot from legacy FD, HD, CD, PCMCIA, USB, and Network"
#string STR_BOOT_LEGACY_FLOPPY         #language en-US  "Boot From Floppy"
                                       #language zh-Hans  "Boot From Floppy"
#string STR_BOOT_LEGACY_HARDDRIVE      #language en-US  "Boot From Hard Drive"
                                       #language zh-Hans  "Boot From Hard Drive"
#string STR_BOOT_LEGACY_CDROM          #language en-US  "Boot From CD Rom"
                                       #language zh-Hans  "Boot From CD Rom"
#string STR_BOOT_LEGACY_PCMCIA         #language en-US  "Boot From PCMCIA"
                                       #language zh-Hans  "Boot From PCMCIA"
#string STR_BOOT_LEGACY_USB            #language en-US  "Boot From USB Device"
                                       #language zh-Hans  "Boot From USB Device"
#string STR_BOOT_LEGACY_NETWORK        #language en-US  "Boot From Network"
                                       #language zh-Hans  "Boot From Network"
#string STR_DISABLE_LEGACY_DEVICE      #language en-US  "Disabled"
                                       #language zh-Hans  "Disabled"
#string STR_FILE_EXPLORER_TITLE        #language en-US  "File Explorer"
                                       #language zh-Hans  "File Explorer"
#string STR_OUT_OF_BAND_PORT           #language en-US  "Out-Of-Band Mgmt Port"
                                       #language zh-Hans  "Out-Of-Band Mgmt Port"

#string STR_ENABLE_BOOTTIME             #language en-US "BootTime Log"
                                        #language zh-Hans "BootTime Log"
#string STR_ENABLE_BOOTTIME_HELP        #language en-US "Enabled: Display BootTime for OS Booting"
                                        #language zh-Hans "Enabled: Display BootTime for OS Booting"
#string STR_BOOT_FORM                   #language en-US "Boot Setting"
                                        #language zh-Hans "Boot Setting"
#string STR_BOOT_FORM_HELP              #language en-US "System Boot Configuration Settings"
                                        #language zh-Hans "System Boot Configuration Settings"
#string STR_NORMAL_BOOT                 #language en-US "Normal Boot"
                                        #language zh-Hans "Normal Boot"
#string STR_QUIET_BOOT                  #language en-US "Quiet Boot"
                                        #language zh-Hans "Quiet Boot"
#string STR_SILENT_BOOT                 #language en-US "Silent Boot"
                                        #language zh-Hans "Silent Boot"
#string STR_DISPLAY_BOOT_MODE           #language en-US "Display Boot Mode"
                                        #language zh-Hans "Display Boot Mode"
#string STR_DISPLAY_BOOT_MODE_HELP      #language en-US "Select display boot mode."
                                        #language zh-Hans "Select display boot mode."
#string STR_FAST_BOOT                   #language en-US "Fast Boot"
                                        #language zh-Hans "Fast Boot"
#string STR_FAST_BOOT_HELP              #language en-US "Enables/Disables boot with initialization of a minimal set of devices required to launch active boot option. Has no effect for BBS boot options."
                                        #language zh-Hans "Enables/Disables boot with initialization of a minimal set of devices required to launch active boot option. Has no effect for BBS boot options."
#string STR_BOOT_TIMEOUT                #language en-US "Setup Prompt Timeout"
                                        #language zh-Hans "Setup Prompt Timeout"
#string STR_BOOT_TIMEOUT_HELP           #language en-US "Number of seconds to wait for setup activation key. 65535(0xFFFF) means indefinite waiting."
                                        #language zh-Hans "Number of seconds to wait for setup activation key. 65535(0xFFFF) means indefinite waiting."
#string STR_CSM_BOOTUP_NUMLOCK          #language en-US "Bootup NumLock State"
                                        #language zh-Hans "Bootup NumLock State"
#string STR_CSM_BOOTUP_NUMLOCK_HELP     #language en-US "Select the keyboard NumLock state."
                                        #language zh-Hans "Select the keyboard NumLock state."
#string STR_CSM_BOOTUP_NUMLOCK_ON       #language en-US "On"
                                        #language zh-Hans "\wide打开\narrow"
#string STR_CSM_BOOTUP_NUMLOCK_OFF      #language en-US "Off"
                                        #language zh-Hans "\wide关闭\narrow"
#string STR_OPROM_MESSAGE               #language en-US "Option Rom Message"
                                        #language zh-Hans "Option Rom Message"
#string STR_OPROM_MESSAGE_HELP          #language en-US "Enable/Disable the display of Option Rom's message"
                                        #language zh-Hans "Enable/Disabls the display of Option Rom's message"
#string STR_ENABLE_TRAP6064H            #language en-US "Port 60/64h Trap under OS"
                                        #language zh-Hans "Port 60/64h Trap under OS"
#string STR_ENABLE_TRAP6064H_HELP       #language en-US "Enable/Disable Trap 60/64h after boot to OS, it just serves for Non ACPI OS, such as QNX and VxWorks"
                                        #language zh-Hans "Enable/Disable Trap 60/64h after boot to OS, it just serves for Non ACPI OS, such as QNX and VxWorks"
#string STR_ENABLE_EFIOS                #language en-US "Enable Efi OS"
                                        #language zh-Hans "Enable Efi OS"
#string STR_ENABLE_EFIOS_HELP           #language en-US "Enable/Disable Efi OS, system will don't show the EFI CD/DVD boot option if Efi OS disabled. This function only valid in ahci and raid mode."
                                        #language zh-Hans "Enable/Disable Efi OS, system will don't show the EFI CD/DVD boot option if Efi OS disabled. This function only valid in ahci and raid mode."
#string STR_ENABLE_CSM                  #language en-US "CSM"
                                        #language zh-Hans "\wide兼容模块\narrow"
#string STR_ENABLE_CSM_HELP             #language en-US "Compatibility support Module. Permit the loading of a traditional operation system.Enable: to support Non-UEFI operation system.Disable: to support Win8 64-bit and later UEFI aware operation system."
                                        #language zh-Hans "\wide兼容性模块-允许加载传统操作系统。\narrow[\wide打开\narrow]\wide支持\narrowNon-UEFI \wide操作系统\narrow.[\wide关闭\narrow]\wide支持\narrowWin8 64-bit \wide和其它\narrowUEFI \wide操作系统.\narrow"
#string STR_BOOT_MODE                   #language en-US "Boot Mode"
                                        #language zh-Hans "\wide启动方式\narrow"
#string STR_BOOT_MODE_HELP              #language en-US "Select "ALL", system will try to boot to UEFI or legacy operating system.Select "UEFI Only", system will only boot to UEFI aware operating system.Select "Legacy Only", system will only boot to legacy operating system."
                                        #language zh-Hans "\wide选择启动方式\narrow: \wide从\narrowLegacy\wide启动设备或支持\narrowUFEI\wide启动方式的设备启动.选择"自动", 系统将顺序按照启动设备序列中的设备启动,优先采用\narrowUEFI\wide启动方式.选择\narrow"UEFI":\wide系统将只选择\narrowUEFI\wide启动设备启动;选择\narrow"Legacy":\wide系统将只选择\narrowLegacy\wide启动设备启动\narrow"
#string STR_ALL                         #language en-US "All"
                                        #language zh-Hans "\wide全部\narrow"
#string STR_UEFI_ONLY                   #language en-US "UEFI Only"
                                        #language zh-Hans "UEFI"
#string STR_LEGACY_ONLY                 #language en-US "Legacy Only"
                                        #language zh-Hans "Legacy"
#string STR_BOOT_PRIORITY               #language en-US "Boot Priority"
                                        #language zh-Hans "\wide启动优先级\narrow"
#string STR_BOOT_PRIORITY_HELP          #language en-US "Select "UEFI First", system will try to boot to UEFI OS first and then legacy OS.Select "Legacy First", system will try to boot to legacy OS first and then UEFI OS."
                                        #language zh-Hans "\wide选择"\narrowUEFI\wide优先",系统将会首先尝试引导\narrowUEFI\wide系统，然后尝试引导传统系统;选择"\narrowLegacy\wide"优先，系统将首先尝试从\narrowLegacy\wide系统引导，然后从\narrowUEFI\wide系统引导.\narrow"
#string STR_UEFI_FIRST                  #language en-US "UEFI First"
                                        #language zh-Hans "UEFI \wide优先\narrow"
#string STR_LEGACY_FIRST                #language en-US "Legacy First"
                                        #language zh-Hans "Legacy \wide优先\narrow"
#string STR_OPT_KEY_DISPLAY             #language en-US "Option Keys Display"
                                        #language zh-Hans  "\wide选项键显示\narrow"
#string STR_OPT_KEY_DISPLAY_HELP        #language en-US "Controls the system software option key prompts (such as F1 key) when the system is turned on. Select "Enabled" to display the prompts.NOTE:Disabling the prompts will not affect the function of a specific key."
                                        #language zh-Hans  "\wide系统开机时控制系统选项键（例如\narrowF1\wide）的提示。\n注意:\n关闭提示不会影响功能键的使用。\narrow"
#string STR_OPT_KEY_DISPLAY_STYLE       #language en-US "Option Keys Display Style"
                                        #language zh-Hans  "\wide选项键显示类型\narrow"
#string STR_OPT_KEY_DISPLAY_STYLE_HELP  #language en-US "Controls the style of prompts displayed on the POST logo screen when the system is turned on. Choosing "Normal" will prompt for the Enter key and display a menu. Choosing "Legacy" will prompt for F1 and F12."
                                        #language zh-Hans  "\wide系统开机时控制在\narrowPOST LOGO\wide屏幕的显示提示.选择一般会提示\narrowEnter\wide键。选择传统，会提示 \narrowF1\wide和\narrowF12\wide的提示。\narrow"
#string STR_NORMAL                      #language en-US "Normal"
                                        #language zh-Hans  "\wide一般\narrow"
#string STR_LEGACY                      #language en-US "Legacy"
                                        #language zh-Hans  "\wide传统\narrow"
#string STR_STRARTUP_PROMPT             #language en-US "Startup Device Menu Prompt"
                                        #language zh-Hans  "\wide启动设备菜单提示\narrow"
#string STR_STRARTUP_PROMPT_HELP        #language en-US "Allows the Startup Device Menu to be displayed by pressing F12 after the system is turned on. The Startup Device Menu allows the sequence of startup devices to be temporarily changed."
                                        #language zh-Hans  "\wide允许在开机后通过\narrowF12\wide调用启动设备菜单。启动设备菜单可以允许临时选择可启的设备。\narrow"

#string STR_BOOT_ORDER_SUBTITLE         #language en-US "Boot Option Priorities"
                                        #language zh-Hans "Boot Option Priorities"
#string STR_BOOT_ORDER_X                #language en-US "Boot Option #%d"
                                        #language zh-Hans "Boot Option #%d"
#string STR_BOOT_ORDER_HELP             #language en-US "Set the system boot order."
                                        #language zh-Hans "Set the system boot order."
#string STR_ADD_BOOT_OPTION             #language en-US "Add New Boot Option"
                                        #language zh-Hans "Add New Boot Option"
#string STR_ADD_BOOT_OPTION_HELP        #language en-US "Add a new EFI boot option to the boot order."
                                        #language zh-Hans "Add a new EFI boot option to the boot order."
#string STR_DEL_BOOT_OPTION             #language en-US "Delete Boot Option"
                                        #language zh-Hans "Delete Boot Option"
#string STR_DEL_BOOT_OPTION_HELP        #language en-US "Remove an EFI boot option from the boot order."
                                        #language zh-Hans "Remove an EFI boot option from the boot order."
#string STR_SELECT_TO_DEL               #language en-US "Select one to Delete"
                                        #language zh-Hans "Select one to Delete"
#string STR_BBS_ORDER_HELP              #language en-US "Set the order of the legacy devices in this group."
                                        #language zh-Hans "Set the order of the legacy devices in this group."
#string STR_ADD_BOOT_LABEL              #language en-US "Add boot option"
                                        #language zh-Hans "Add boot option"
#string STR_BOOT_LABEL_HELP             #language en-US "Create new boot option."
                                        #language zh-Hans "Create new boot option."
#string STR_ADD_BOOT_SEL_FS             #language en-US "Select Filesystem"
                                        #language zh-Hans "Select Filesystem"
#string STR_BOOT_FS_HELP                #language en-US "Select one filesystem from the list."
                                        #language zh-Hans "Select one filesystem from the list."
#string STR_ADD_BOOT_PATH               #language en-US "Path for boot option"
                                        #language zh-Hans "Path for boot option"
#string STR_BOOT_PATH_HELP              #language en-US "Enter the path to the boot option in the format fs0:\\path\\filename.efi."
                                        #language zh-Hans "Enter the path to the boot option in the format fs0:\\path\\filename.efi."
#string STR_SAVE_BOOT_OPTION            #language en-US "Create"
                                        #language zh-Hans "Create"
#string STR_ENABLED                     #language en-US "Enabled"
                                        #language zh-Hans "\wide打开\narrow"
#string STR_DISABLED                    #language en-US "Disabled"
                                        #language zh-Hans "\wide关闭\narrow"
